[
    {
        "Source_Infotype": "0001",
        "Source_Type": "Infotype",
        "Tittle": "Formatting error in the field P0001-ANSVH",
        "Severity":"Low",
        "Summary": "Error causado cuando el contrato no se carga en SAP, debido a que en Workday este no fue cargado de forma correcta por fecha efectiva o contenido como la duracion si es ilimitado o limitado",
        "Preconditions": [
            "Contrato activo en Workday",
            "Fechas acordes a contratacion o cambio de puesto",
            "Proceso terminado en tiempo y forma"
        ],
        "questions": [
            "¿El contrato fue completado exitosamente en Workday?",
            "¿La fecha del contrato coincide con la de contratacion?"
        ],
        "resolution_steps": [
            "Revisa el perfil del empleado en Workday",
            "Asegurate de que el tipo se acorde a lo necesitado",
            "las fechas deben coincidir entre el ingreso/cambio y el contrato"
        ],
        "Fallbacks": [
            "Si el error persiste, contacta a Recursos Humanos para validarlo"
        ]
    },
    {
        "Source_Infotype": "0006",
        "Source_Type": "Infotype",
        "Tittle": "Formatting error in the field P0006-STRAS",
        "Severity":"Low",
        "Summary": "Ocasionado cuando se ingresan caracteres no permitidos en la entrada",
        "Preconditions": [
            "Calle registrada",
            "Ningun caracter adicional",
            "Proceso terminado en tiempo y forma"
        ],
        "questions": [
            "¿La calle del empleado se ingreso correctamente?",
            "¿No hay ningun caracter adicional?",
            "¿Existe el registro actualmente en el perfil del empleado?"
        ],
        "resolution_steps": [
            "Elimina cualquier caracter adicional como |, *, ?, ¿, ¡, etc. que pueda entorpecer el archivo de carga",
            "ingresa toda la informacion relacionada con el campo",
            "De no existir, crea la entrada que sera transferida en la siguiente integracion"
        ],
        "Fallbacks": [
            "Si el error persiste, contacta a Recursos Humanos para validarlo",        
            "Si hay algun caracter adicional, contacta al grupo de IT"
        ]
    },
    {
        "Source_Infotype": "0000",
        "Source_Type": "Infotype",
        "Tittle": "Invalid combination of action type 1A/action reason CA",
        "Severity": "Medium",
        "Summary": "",
        "Preconditions": [
            "El empleado fue contratado",
            "Se ingreso la contratacion en tiempo y forma",
            "Se usaron las condiciones exactas para cada tipo"
        ],
        "questions": [
            "¿Cual es la condicion del empleado?",
            "¿Es una recontratacion (Rehire) o contratacion (Hire)?",
            "¿El empleado exite actualmente en SAP?"
        ],
        "resolution_steps": [
            "Revisa que las condiciones coincidan para contratacion y recontratacion",
            "Si el empleado no esta en SAP, se creara bajo el termino de 'contratacion'"
        ],
        "Fallbacks": [
            "En caso de seguir con la falla, procura asegurarte que coincidan los terminos de la contratacion."
        ]
    },
    {
        "Source_Infotype": "NITR",
        "Source_Type": "No Infotype Related",
        "Tittle": "Person is already being processed by user ########",
        "Severity": "Low",
        "Preconditions": [
            "El empleado exite",
            "El empleado esta libre para su modificacion",
            "Nadie esta usando o editando al empleado que se intentaba integrar"
        ],
        "questions": [
            "¿El empleado estaba libre para su edicion al momento de la carga?",
            "¿Lo esta ahora?"
        ],
        "resolution_steps": [
            "Valida con el usuario que esta en el error si ya no esta haciendo uso del perfil del empleado"
        ],
        "Fallbacks": [
            "Consulta con el empleado directo, o en dado caso, escalar el caso"
        ]
    },
    {
        "Source_Infotype": "0002",
        "Source_Type": "Infotype",
        "Tittle": "Incorrect date of birth in CURP",
        "Severity": "Medium",
        "Preconditions": [
            "La ID fue introducida correctamente",
            "Todos los digitos coinciden con la informacion registrada previamente",
            "Se cargo en tiempo y forma"
        ],
        "questions": [
            "¿Se cargo la ID de forma correcta, sin digitos no autorizados?",
            "¿Los digitos de la fecha de nacimiento coinciden con los que se registraron?",
            "¿Fue terminada al mismo tiempo que los demas procesos?"
        ],
        "resolution_steps": [
            "Verifica los digitos para la fecha de nacimiento, deben coincidir con los registrados previamente"
        ],
        "Fallbacks": [
            "Revisa nuevamente la informacion introducida, de lo contrario acude a recursos humanos para la validacion de la información"
        ]
    },
    {
        "Source_Infotype": "0007",
        "Source_Type": "Infotype",
        "Tittle": "No work schedule rule for key 0103ZY3942TW020220191014",
        "Severity": "High",
        "Preconditions": [
            "El turno fue ingresado en Workday",
            "Corresponde a la compañia asignada",
            "Se cargo en tiempo y forma"
        ],
        "questions": [
            "¿El empleado esta activo para el cambio que se realizo?",
            "¿El turno asignado corresponde a la compañia en la que el empleado esta?",
            "¿El turno fue creado en SAP previamente?"
        ],
        "resolution_steps": [
            "Valida si el turno corresponde a la compañia, de lo contrario procede a cambiarlo",
            "Si se cargo fuera de la ventana de integracion, espera a la siguiente",
            "Si es un turno nuevo, valida con HRIS que se haya creado previamente"
        ],
        "Fallbacks": [
            "Si el turno no existe en SAP, pide a nominas que se cree dicho turno",
            "Revalida si el turno que se esta asignando si es parte de los permitidos para la compañia"
        ]
    }
]